tests/load/elang-read-endpoints.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  JMeter read-endpoint load test for mod_elang.

  Hammers the REST web service mod_elang_get_version_content (the batched
  content-assembly read) with a configurable thread group and asserts each
  response is HTTP 200 and does not carry a web-service "exception" field.

  Parameters (pass with -J, defaults in each Argument):
    base_url token cmid versionid threads rampup loops maxduration

  Run against a disposable dev/staging site only. See tests/load/README.md.

  @package    mod_elang
  @copyright  2026 Ralf Erlebach
  @license    http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="mod_elang read endpoints" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="base_url" elementType="Argument">
            <stringProp name="Argument.name">base_url</stringProp>
            <stringProp name="Argument.value">${__P(base_url,http://localhost)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="token" elementType="Argument">
            <stringProp name="Argument.name">token</stringProp>
            <stringProp name="Argument.value">${__P(token,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="versionid" elementType="Argument">
            <stringProp name="Argument.name">versionid</stringProp>
            <stringProp name="Argument.value">${__P(versionid,0)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="cmid" elementType="Argument">
            <stringProp name="Argument.name">cmid</stringProp>
            <stringProp name="Argument.value">${__P(cmid,0)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Readers" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(loops,20)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(threads,10)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,30)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="get_version_content" enabled="true">
          <!-- No argument collection here, deliberately.

               JMeter does not append configured arguments when the path field
               holds an absolute URL, and the path here has to be absolute
               because the target is passed in as one property (base_url), the
               same way the k6 plan takes it. The result was a request without
               any query string at all: Moodle answered 200 with an
               "invalidtoken" XML document, every sample failed its assertion,
               and the run looked like a total outage rather than a broken plan.

               So the query lives in the path. The values are a hex token, a
               numeric id and a URL, none of which need encoding. -->
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.path">${base_url}/webservice/rest/server.php?wstoken=${token}&amp;wsfunction=mod_elang_get_version_content&amp;moodlewsrestformat=json&amp;versionid=${versionid}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <!-- Arrival rate, not concurrency.

               JMeter has no equivalent of k6's constant-arrival-rate executor,
               so the rate is set by a throughput timer and the threads only
               provide enough parallelism to meet it. Before this the plan ran
               200 threads in a loop with no pause, which is 200 requests
               permanently in flight rather than 200 learners opening an
               exercise over three minutes — the same mistake the k6 plan made,
               and the reason a healthy server measured 29 seconds.

               arrivals_per_minute = learners / (arrival window in minutes).
               calcMode 2 = "all active threads in this thread group", so the
               figure is the rate for the whole group rather than per thread. -->
          <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Ankunftsrate" enabled="true">
            <intProp name="calcMode">2</intProp>
            <stringProp name="throughput">${__P(arrivals_per_minute,67)}</stringProp>
          </ConstantThroughputTimer>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Under the latency limit" enabled="true">
            <stringProp name="DurationAssertion.duration">${__P(p95,800)}</stringProp>
          </DurationAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response contains cues" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-1424523694">&quot;cues&quot;</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>