tests/load/jmeter.log
2026-08-12 21:27:58,532 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-08-12 21:27:58,551 INFO o.a.j.JMeter: Loading user properties from: /var/www/html/moodle45_aliseadele/mod/elang/tests/load/apache-jmeter-5.6.3/bin/user.properties
2026-08-12 21:27:58,551 INFO o.a.j.JMeter: Loading system properties from: /var/www/html/moodle45_aliseadele/mod/elang/tests/load/apache-jmeter-5.6.3/bin/system.properties
2026-08-12 21:27:58,551 INFO o.a.j.JMeter: Setting JMeter property: base_url=http://localhost/moodle45_aliseadele
2026-08-12 21:27:58,551 INFO o.a.j.JMeter: Setting JMeter property: token=ecdd32edec50a0b60ff2f1a6dd5f3316
2026-08-12 21:27:58,551 INFO o.a.j.JMeter: Setting JMeter property: cmid=716
2026-08-12 21:27:58,551 INFO o.a.j.JMeter: Setting JMeter property: versionid=3
2026-08-12 21:27:58,551 INFO o.a.j.JMeter: Setting JMeter property: threads=25
2026-08-12 21:27:58,552 INFO o.a.j.JMeter: Setting JMeter property: rampup=10
2026-08-12 21:27:58,552 INFO o.a.j.JMeter: Setting JMeter property: loops=20
2026-08-12 21:27:58,552 INFO o.a.j.JMeter: Setting JMeter property: maxduration=2000
2026-08-12 21:27:58,557 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-08-12 21:27:58,558 INFO o.a.j.JMeter: Version 5.6.3
2026-08-12 21:27:58,558 INFO o.a.j.JMeter: java.version=21.0.11
2026-08-12 21:27:58,558 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-08-12 21:27:58,558 INFO o.a.j.JMeter: os.name=Linux
2026-08-12 21:27:58,558 INFO o.a.j.JMeter: os.arch=amd64
2026-08-12 21:27:58,558 INFO o.a.j.JMeter: os.version=6.18.33.2-microsoft-standard-WSL2
2026-08-12 21:27:58,558 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-08-12 21:27:58,558 INFO o.a.j.JMeter: java.awt.headless=true
2026-08-12 21:27:58,558 INFO o.a.j.JMeter: Max memory     =1073741824
2026-08-12 21:27:58,558 INFO o.a.j.JMeter: Available Processors =14
2026-08-12 21:27:58,568 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-08-12 21:27:58,569 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-08-12 21:27:58,569 INFO o.a.j.JMeter: JMeterHome=/var/www/html/moodle45_aliseadele/mod/elang/tests/load/apache-jmeter-5.6.3
2026-08-12 21:27:58,569 INFO o.a.j.JMeter: user.dir  =/var/www/html/moodle45_aliseadele/mod/elang/tests/load
2026-08-12 21:27:58,569 INFO o.a.j.JMeter: PWD       =/var/www/html/moodle45_aliseadele/mod/elang/tests/load
2026-08-12 21:27:58,570 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: LAPTOP-M1G9QRV1 FullName: LAPTOP-M1G9QRV1.localdomain
2026-08-12 21:27:58,587 INFO o.a.j.s.FileServer: Default base='/var/www/html/moodle45_aliseadele/mod/elang/tests/load'
2026-08-12 21:27:58,589 INFO o.a.j.s.FileServer: Set new base='/var/www/html/moodle45_aliseadele/mod/elang/tests/load'
2026-08-12 21:27:58,788 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-08-12 21:27:58,817 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-08-12 21:27:58,821 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-08-12 21:27:58,826 INFO o.a.j.s.SaveService: Loading file: elang-read-endpoints.jmx
2026-08-12 21:27:58,881 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-12 21:27:58,881 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-12 21:27:58,881 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-12 21:27:58,881 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-12 21:27:58,881 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-08-12 21:27:58,882 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-08-12 21:27:58,919 INFO o.a.j.JMeter: Creating summariser <summary>
2026-08-12 21:27:58,931 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-08-12 21:27:58,932 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-12 21:27:58,932 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-12 21:27:58,937 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-08-12 21:27:58,937 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-08-12 21:27:59,010 INFO o.a.j.JMeter: Running test (1786562879009)
2026-08-12 21:27:59,036 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Readers
2026-08-12 21:27:59,036 INFO o.a.j.e.StandardJMeterEngine: Starting 25 threads for group Readers.
2026-08-12 21:27:59,036 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-08-12 21:27:59,037 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=25 ramp-up=10 delayedStart=false
2026-08-12 21:27:59,045 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-1
2026-08-12 21:27:59,054 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-08-12 21:27:59,054 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-08-12 21:27:59,065 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = LAPTOP-M1G9QRV1
2026-08-12 21:27:59,074 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-08-12 21:27:59,076 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-08-12 21:27:59,077 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-08-12 21:27:59,077 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-08-12 21:27:59,077 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-08-12 21:27:59,440 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-2
2026-08-12 21:27:59,455 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-1
2026-08-12 21:27:59,455 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-1
2026-08-12 21:27:59,711 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-2
2026-08-12 21:27:59,711 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-2
2026-08-12 21:27:59,839 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-3
2026-08-12 21:28:00,003 INFO o.a.j.r.Summariser: summary +     50 in 00:00:01 =   50.4/s Avg:    13 Min:     9 Max:    48 Err:     0 (0.00%) Active: 1 Started: 3 Finished: 2
2026-08-12 21:28:00,138 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-3
2026-08-12 21:28:00,138 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-3
2026-08-12 21:28:00,238 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-4
2026-08-12 21:28:00,498 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-4
2026-08-12 21:28:00,498 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-4
2026-08-12 21:28:00,639 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-5
2026-08-12 21:28:00,884 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-5
2026-08-12 21:28:00,884 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-5
2026-08-12 21:28:01,039 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-6
2026-08-12 21:28:01,383 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-6
2026-08-12 21:28:01,383 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-6
2026-08-12 21:28:01,438 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-7
2026-08-12 21:28:01,696 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-7
2026-08-12 21:28:01,697 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-7
2026-08-12 21:28:01,839 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-8
2026-08-12 21:28:02,109 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-8
2026-08-12 21:28:02,109 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-8
2026-08-12 21:28:02,239 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-9
2026-08-12 21:28:02,505 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-9
2026-08-12 21:28:02,505 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-9
2026-08-12 21:28:02,637 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-10
2026-08-12 21:28:02,874 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-10
2026-08-12 21:28:02,874 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-10
2026-08-12 21:28:03,038 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-11
2026-08-12 21:28:03,264 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-11
2026-08-12 21:28:03,264 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-11
2026-08-12 21:28:03,437 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-12
2026-08-12 21:28:03,667 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-12
2026-08-12 21:28:03,667 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-12
2026-08-12 21:28:03,839 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-13
2026-08-12 21:28:04,092 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-13
2026-08-12 21:28:04,093 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-13
2026-08-12 21:28:04,241 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-14
2026-08-12 21:28:04,493 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-14
2026-08-12 21:28:04,493 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-14
2026-08-12 21:28:04,637 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-15
2026-08-12 21:28:04,895 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-15
2026-08-12 21:28:04,895 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-15
2026-08-12 21:28:05,038 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-16
2026-08-12 21:28:05,290 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-16
2026-08-12 21:28:05,290 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-16
2026-08-12 21:28:05,450 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-17
2026-08-12 21:28:05,693 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-17
2026-08-12 21:28:05,693 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-17
2026-08-12 21:28:05,838 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-18
2026-08-12 21:28:06,067 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-18
2026-08-12 21:28:06,067 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-18
2026-08-12 21:28:06,237 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-19
2026-08-12 21:28:06,474 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-19
2026-08-12 21:28:06,474 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-19
2026-08-12 21:28:06,638 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-20
2026-08-12 21:28:06,923 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-20
2026-08-12 21:28:06,923 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-20
2026-08-12 21:28:07,038 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-21
2026-08-12 21:28:07,314 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-21
2026-08-12 21:28:07,314 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-21
2026-08-12 21:28:07,439 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-22
2026-08-12 21:28:07,719 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-22
2026-08-12 21:28:07,720 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-22
2026-08-12 21:28:07,837 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-23
2026-08-12 21:28:08,114 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-23
2026-08-12 21:28:08,115 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-23
2026-08-12 21:28:08,238 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-24
2026-08-12 21:28:08,512 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-24
2026-08-12 21:28:08,512 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-24
2026-08-12 21:28:08,637 INFO o.a.j.t.JMeterThread: Thread started: Readers 1-25
2026-08-12 21:28:08,913 INFO o.a.j.t.JMeterThread: Thread is done: Readers 1-25
2026-08-12 21:28:08,913 INFO o.a.j.t.JMeterThread: Thread finished: Readers 1-25
2026-08-12 21:28:08,914 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-08-12 21:28:08,915 INFO o.a.j.r.Summariser: summary +    450 in 00:00:09 =   50.5/s Avg:    12 Min:     9 Max:    21 Err:     0 (0.00%) Active: 0 Started: 25 Finished: 25
2026-08-12 21:28:08,915 INFO o.a.j.r.Summariser: summary =    500 in 00:00:10 =   50.5/s Avg:    12 Min:     9 Max:    48 Err:     0 (0.00%)